server/app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises"
SELECT "exercises".* FROM "exercises" WHERE ('"chest"' = ANY (primary_muscles))
---
  def show
    if(exercises_params[:primary_muscle].nil?)
      exercises = Exercise.all
    else
      exercises = Exercise.where("'#{exercises_params[:primary_muscle]}' = ANY (primary_muscles)")