server/app/controllers/logins_controller.rb

  def create
    # look up user
    user = User.find_by(username: user_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "mario"], ["LIMIT", 1]]